[
  {
    "Company Name": "Meta",
    "Title": "Software Engineer",
    "Description": "Software Architecture and Engineering Leadership. Overall coordination, system design, and execution for an LLM-based prototype system that supports continuous sensing experiences with vision understanding, language understanding, eye tracking, object referencing, EMG-detected gestures, and more. I aligned the execution across a multi-disciplinary team, set up and drove the software engineering process, and was hands-on with the development of the system.",
    "Location": "Redmond, Washington, United States",
    "Started On": "Feb 2023",
    "Finished On": ""
  },
  {
    "Company Name": "Magnit",
    "Title": "Software Engineer @ Meta - Reality Labs Research",
    "Description": "",
    "Location": "Redmond, Washington, United States",
    "Started On": "Nov 2022",
    "Finished On": "Feb 2023"
  },
  {
    "Company Name": "Amazon",
    "Title": "Senior Principal Engineer, Alexa Artificial Intelligence",
    "Description": "Provided technical leadership across Alexa. Initiated and delivered Alexa’s multi-skill experiences. Designed and delivered the Alexa Conversations Description Language (ACDL) and related developer-facing tooling. Designed and championed Alexa Schema as the shared ontology across all of Alexa. Initiated a re-architecture of Alexa to support natural, multi-modal interactions (ongoing). Led Alexa’s 180+ community of Principal and Distinguished engineers and scientists.",
    "Location": "Greater Seattle Area",
    "Started On": "Mar 2019",
    "Finished On": "Jun 2022"
  },
  {
    "Company Name": "Microsoft",
    "Title": "Partner Software Architect",
    "Description": "Oversaw Cortana's overall architecture, ensured technology alignment across the product. Led the design and implementation of the next generation interaction management engine. Oversaw the protocol and implementation for the Invoke Speaker, the Cortana-Alexa integration, and Cortana in Skype. Led initiatives to support user-centric experiences such as a user-centric (vs device-centric) notification service and single user profile across Microsoft’s products.",
    "Location": "Greater Seattle Area",
    "Started On": "May 2016",
    "Finished On": "Jan 2019"
  },
  {
    "Company Name": "Facebook",
    "Title": "Software Engineer",
    "Description": "Designed the language understanding platform that processed every post and comment on Facebook to recognize recommendation/direction requests, congratulation messages, and others. Built the language annotation experience. Prototyped a digital friend.",
    "Location": "Menlo Park, CA and Seattle, WA",
    "Started On": "Jan 2015",
    "Finished On": "May 2016"
  },
  {
    "Company Name": "Microsoft",
    "Title": "Principal Software Architect",
    "Description": "Prototyped, together with researchers, the cloud-based experience that became Cortana. Co-founded the Cortana initiative. Architected and coordinated the technical design across teams for the set of services that powered the Cortana experience on phones. Contributed to growing the Cortana cloud organization from a single employee (me) to hundreds. Coordinated Cortana’s cloud services design across multiple teams of thousands. Designed and oversaw the technical execution on key systems such as the Reactor distributed stream processing engine (processed billions of events per day), Personal Data Platform, frontend service, conversational understanding, and more. Delivered the architecture of the voice-based search experience for Xbox + Kinect. Software engineering work on the first version of Bing’s runtime orchestration engine. Highlight: Awarded third “gold star” which was Microsoft’s recognition for high achievement and impact.",
    "Location": "Bellevue, WA",
    "Started On": "Dec 2011",
    "Finished On": "Dec 2014"
  },
  {
    "Company Name": "Microsoft",
    "Title": "Principal Software Engineer",
    "Description": "Prototyped cloud-based infrastructure for big data, compute-intensive workloads for high-performance scenarios using the dryad dataflow computational model (more general version of map-reduce). Invented and prototyped a NoSQL “active” store to support the reactive/stream processing and actor-based computational models. Engineering work on the first version of Bing's runtime orchestration engine. Semantic search prototype for Bing. Highlight: Awarded second “Gold Star” and ranked as “top performer” for the prototyping work.",
    "Location": "Redmond, Washington, United States",
    "Started On": "2008",
    "Finished On": "Nov 2011"
  },
  {
    "Company Name": "Microsoft",
    "Title": "Principal Software Architect",
    "Description": "Worked on technologies, services, and tools to help scientists and researchers be more productive and efficient. Architected, prototyped, and led a team of 20 that implemented Zentity (a graph store to manage an organization’s research output). Technical lead for External Research’s “Cloud Computing for Science” vision, implementation, and deployment. Program management of the Microsoft-Intel joined Universal Parallel Computing Research Centers initiative. Design and development of various plugins for Office for researchers (released as open source). Leading collaborations with scientists worldwide. Highlight: Awarded “Gold Star” and ranked as “top performer” for my impact.",
    "Location": "",
    "Started On": "2006",
    "Finished On": "2008"
  },
  {
    "Company Name": "Microsoft",
    "Title": "Program Manager",
    "Description": "Editor of two key Web Services (WS-*) specifications on behalf of Microsoft. Design and prototyping work on “Oslo”, a declarative, data-oriented programming language.",
    "Location": "",
    "Started On": "Sep 2005",
    "Finished On": "2006"
  },
  {
    "Company Name": "University of Newcastle",
    "Title": "Chief Software Architect and Principal Research Associate",
    "Description": "Research in the areas of service-oriented, distributed, high-performance computing with an emphasis on Internet-scale architectures. The focal point was the articulation of architectural principles for Internet-scale computing and how they could be applied using Web Services technologies in service of eScience applications. Architecture and design of the North-East Regional eScience Center’s research projects. Standardization work in the Web Services and Grid Computing organizations.",
    "Location": "",
    "Started On": "Jan 2003",
    "Finished On": "Sep 2005"
  },
  {
    "Company Name": "Greek Army Forces",
    "Title": "Private",
    "Description": "Fulfillment of the military service duty (awarded a distinction of honor).",
    "Location": "",
    "Started On": "Dec 2001",
    "Finished On": "Jan 2003"
  },
  {
    "Company Name": "Hewlett-Packard",
    "Title": "Senior Software Engineer",
    "Description": "Co-investigator in an R&D team in Transactions for Web Services. Principal role in the research, design, and implementation of the XML Transaction Service (XTS) the prototype on which the HP-WTS 1.0 product was based.",
    "Location": "",
    "Started On": "Jan 2001",
    "Finished On": "Oct 2001"
  },
  {
    "Company Name": "University of Newcastle",
    "Title": "Research Associate",
    "Description": "Post-doctoral research in parallel, high-performance computing using clusters of workstations and object-oriented, visual programming languages for parallel computing.",
    "Location": "",
    "Started On": "2000",
    "Finished On": "2001"
  }
]